Repository: DawnLiExp/Me2Press
Catalog: Me2Press/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: About Me2Press
zh_hans: 关于 Me2Press

# button.clear_all
source: Clear All
zh_hans: 全部清除

# button.clear_log
source: Clear
zh_hans: 清空日志

# button.convert
source: Convert
zh_hans: 开始转换

# button.copy_log
source: Copy All
zh_hans: 复制全部

# button.remove
source: Remove
zh_hans: 移除

# button.stop
source: Stop
zh_hans: 停止

# error.cover_context
source: Failed to create graphics context for cover.
zh_hans: 封面图形上下文创建失败

# error.cover_encode
source: Failed to encode cover image.
zh_hans: 封面图片编码失败

# error.cover_image
source: Failed to render cover image.
zh_hans: 封面图片渲染失败

# error.decode_failed_enc %@
source: Failed to decode file with encoding: %1$@
zh_hans: 文件解码失败，编码：%1$@

# error.empty_file
source: (Empty File)
zh_hans: (空文件)

# error.empty_file_name %@
source: File is empty: %1$@
zh_hans: 文件内容为空：%1$@

# error.epub_build %@
source: Failed to build EPUB: %1$@
zh_hans: EPUB 构建失败：%1$@

# error.epub_too_large
source: EPUB exceeds the 600 MB kindlegen limit.
zh_hans: EPUB 文件超出 kindlegen 600 MB 限制

# error.kindlegen_failed %d
source: kindlegen exited with error (code %1$d).
zh_hans: kindlegen 转换失败（退出码 %1$d）

# error.mobi_format %@
source: Invalid MOBI format: %1$@
zh_hans: MOBI 格式错误：%1$@

# error.no_images %@
source: No images in folder: %1$@
zh_hans: 文件夹无图片：%1$@

# error.recovery.check_kindlegen
source: Please check that kindlegen is correctly configured in Settings.
zh_hans: 请在设置中确认 kindlegen 路径配置正确

# error.recovery.epub_too_large
source: Try splitting the source into smaller volumes.
zh_hans: 请将源文件拆分为更小的卷后重试

# error.zip_failed %d
source: ZIP packaging failed (exit code %1$d).
zh_hans: ZIP 打包失败（退出码 %1$d）

# error.zip_rename %d
source: ZIP rename failed (exit code %1$d).
zh_hans: ZIP 重命名失败（退出码 %1$d）

# format.output
source: Output Format
zh_hans: 输出格式

source: KindleGen Configuration
zh_hans: KindleGen 配置

source: kindlegen Path
zh_hans: kindlegen 路径

# label.batch_drag_desc
source: Support batch dragging multiple files
zh_hans: 支持批量拖入多个文件

# label.books_count
source: Books
zh_hans: 本书籍

# label.comic_desc
source: Convert image folders to MOBI (Fixed Layout)
zh_hans: 将图片文件夹转换为 MOBI

# label.comic_folder_desc
source: Each folder will be packed as a comic book
zh_hans: 每个文件夹将打包为一本漫画书

# label.comic_folder_rule
source: Drop an image folder to pack it as one MOBI. Drop a parent folder with no images to auto-expand its sub-folders. Two levels max.
zh_hans: 拖入含图片的文件夹，打包为单个 MOBI；拖入无图片的父目录，自动展开其含图子目录分别打包。最多支持两级目录。

# label.custom_cover
source: Custom Cover
zh_hans: 自定义封面

# label.drag_epub_files
source: Drag EPUB Files
zh_hans: 拖入 EPUB 文件

# label.drag_image_folders
source: Drag Image Folders
zh_hans: 拖入图片文件夹

# label.drag_txt_files
source: Drag TXT Files
zh_hans: 拖入 TXT 文件

# label.epub_desc
source: Convert EPUB files to AZW3 format
zh_hans: 将 EPUB 电子书转换为 AZW3 格式

# label.folders_count
source: Folders
zh_hans: 个文件夹

# label.logs
source: Logs
zh_hans: 处理日志

# label.pending_files
source: Pending Files
zh_hans: 待处理文件

# label.pending_folders
source: Pending Folders
zh_hans: 待处理文件夹

# label.show_in_finder
source: Show in Finder
zh_hans: 在 Finder 中显示

# label.show_logs
source: Show Logs
zh_hans: 显示日志

# label.unsupported_drop
source: Unsupported Item
zh_hans: 不支持的类型

# log.all_items_done %lld %@
source: ✅ All %1$lld item(s) processed in %2$@
zh_hans: ✅ 所有 %1$lld 个项目处理完成，耗时 %2$@

# log.batch_cancelled
source: ⚠️ Conversion cancelled by user.
zh_hans: ⚠️ 用户已取消转换

# log.cancelled
source: Cancelled.
zh_hans: 已取消

# log.done %@
source: ✅ Done: %1$@
zh_hans: ✅ 完成：%1$@

# log.error %@
source: ❌ Failed: %1$@
zh_hans: ❌ 失败：%1$@

# log.split_volumes %lld
source: Auto-split into %1$lld volumes
zh_hans: 自动分为 %1$lld 卷

# log.start %@
source: Starting: %1$@
zh_hans: 开始转换：%1$@

# log.step.build_epub
source: Build EPUB
zh_hans: 构建 EPUB

# log.step.dualmetafix
source: DualMetaFix
zh_hans: 修复元数据 (DualMetaFix)

# log.step.kindlegen
source: kindlegen
zh_hans: 运行 kindlegen

# log.step.pack_zip
source: Pack ZIP
zh_hans: 打包 ZIP

# log.step.parse_txt
source: Parse TXT
zh_hans: 解析 TXT

# log.total_time %@
source: total: %1$@
zh_hans: 总计：%1$@

# option.indent
source: First Line Indent
zh_hans: 段落首行缩进

# option.keep_line_breaks
source: Keep Original Line Breaks
zh_hans: 保留原始换行

# progress.building_epub
source: Building EPUB
zh_hans: 构建 EPUB

# progress.done
source: All Done
zh_hans: 全部完成

# progress.file %lld %lld
source: File %1$lld of %2$lld
zh_hans: 第 %1$lld / %2$lld 个文件

# progress.fixing_meta
source: Fixing Metadata
zh_hans: 修复元数据

# progress.kindlegen
source: Running kindlegen
zh_hans: 运行 kindlegen

# progress.packing
source: Packing ZIP
zh_hans: 打包 ZIP

# progress.parsing
source: Parsing TXT
zh_hans: 解析 TXT

# progress.processing
source: Processing…
zh_hans: 处理中…

# progress.scanning
source: Scanning Images
zh_hans: 扫描图片

# progress.volume %lld %lld
source: Vol.%1$lld / %2$lld
zh_hans: 第 %1$lld / %2$lld 卷

source: Select kindlegen executable
zh_hans: 选择 kindlegen 可执行文件

source: Select...
zh_hans: 选择...

# setting.author.header
source: Book Metadata
zh_hans: 书籍元数据

# setting.author.hint
source: Written to dc:creator in newly generated EPUB and MOBI files.
zh_hans: 将写入新生成的 EPUB / MOBI 文件的 dc:creator 字段

# setting.author.label
source: Author
zh_hans: 作者

# setting.author.placeholder
source: e.g. Me2Press
zh_hans: 例：Me2Press

# setting.chapter_regex.add
source: Add Rule
zh_hans: 添加规则

# setting.chapter_regex.header
source: Chapter Detection
zh_hans: 章节识别规则

# setting.chapter_regex.hint
source: One regex per row. A matching line becomes a chapter title. Applies to TXT conversion only.
zh_hans: 每行一条正则，匹配的行将被识别为新章节标题。仅作用于 TXT 转换。

# setting.chapter_regex.level_help
source: Heading level: L1 = part/volume (outermost), L2 = chapter, L3 = section. Sets the TOC hierarchy and HTML heading size.
zh_hans: 标题层级：L1 = 卷/部（最外层），L2 = 章，L3 = 节。影响目录层级和标题字号大小。

# setting.chapter_regex.placeholder
source: Regular expression
zh_hans: 正则表达式

# setting.chapter_regex.restore
source: Restore Defaults
zh_hans: 恢复默认

# setting.concurrency.hint
source: Higher values convert faster but use more CPU.
zh_hans: 数值越大转换越快，同时占用更多 CPU 资源

# setting.concurrency.label
source: Concurrent Tasks
zh_hans: 并发任务数

# setting.performance
source: Performance
zh_hans: 转换性能

# status.kindlegen.missing
source: ❌ kindlegen Not Found
zh_hans: KindleGen 未配置

# status.kindlegen.ready
source: ✅ kindlegen Ready
zh_hans: KindleGen 就绪

# tab.comic
source: Comic Book
zh_hans: 漫画书籍

# tab.epubbook
source: EPUB Book
zh_hans: EPUB 转换

# tab.textbook
source: Text Book
zh_hans: TXT书籍
